InformationRegisters/ЛБ_СостояниеЗалоговогоБилета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_СостояниеЗалоговогоБилета</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПричинаПрименения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ПричиныПримененияПроцентнойСхемы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусЗалоговогоБилета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_СтатусыЗалоговыхБилетов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаЗайма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаНачалаРасчетаПроцентов</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерДопСоглашения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВыкупа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВыкупаЛьготныйСрок</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаПроцентовДень</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаПроцентовСрок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредельныйСрокЗайма</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредельныйСрокЗаймаДни</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОстановкиНачислений</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОплатыБезПродления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Залогодатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Залогодатели</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗалоговыйБилет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ОперацияПоЗалогу</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерЗалоговогоБилета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СхемаКредитования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_СхемыКредитования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonForms/ЛБ_ВыборЗалоговыхБилетов/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Организация") Тогда
		Организация = Параметры.Организация; 
	КонецЕсли;	
	Если Параметры.Свойство("Ломбард") Тогда
		Ломбард = Параметры.Ломбард; 
	КонецЕсли;	  
	Если НЕ ЗначениеЗаполнено(Организация) Тогда
		Организация = Константы.ЛБ_ОсновнаяОрганизация.Получить();
	КонецЕсли;	
КонецПроцедуры
				
&НаКлиенте
Процедура ОК(Команда)  
	СписокЗБ.Очистить();
	СтрокаОшибок = "";
	КоличествоОшибок = 0;
	Для сч = 1 По Текст.КоличествоСтрок() Цикл  
		НомерЗБ = Текст.ПолучитьСтроку(сч);
		ЗБ = ПолучитьЗБ(НомерЗБ);
		Если ЗБ = неопределено Тогда 
			СтрокаОшибок = СтрокаОшибок + ?(ПустаяСтрока(СтрокаОшибок), "", ", ") + "№ " +  СокрЛП(НомерЗБ); 
			КоличествоОшибок = КоличествоОшибок + 1;
		Иначе 
			СписокЗБ.Добавить(ЗБ);
		КонецЕсли;	
	КонецЦикла;	
	Если КоличествоОшибок = 0 Тогда
	    ЭтаФорма.закрыть(СписокЗБ); 
	Иначе	
		Если ЗначениеЗаполнено(Ломбард) Тогда		 
			Если КоличествоОшибок = 1 Тогда    
				Предупреждение("Залоговый билет " + СтрокаОшибок + " в " + сокрЛП(Ломбард) + " не найден.");
			Иначе
				Предупреждение("Залоговые билеты " + СтрокаОшибок + " в " + сокрЛП(Ломбард) + " не найдены.");
			КонецЕсли;	  
		Иначе 
			Если КоличествоОшибок = 1 Тогда    
				Предупреждение("Залоговый билет " + СтрокаОшибок + " в базе не найден.");
			Иначе
				Предупреждение("Залоговые билеты " + СтрокаОшибок + " в базе не найдены.");
			КонецЕсли;	  
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	ЭтаФорма.закрыть();
КонецПроцедуры

&НаСервере
Функция ПолучитьЗБ(НомерЗалоговогоБилета)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Номер", СокрЛП(НомерЗалоговогоБилета));
	Запрос.УстановитьПараметр("Организация", Организация); 
	Запрос.УстановитьПараметр("Ломбард", Ломбард);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.ЗалоговыйБилет КАК ЗалоговыйБилет,
	               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.СтатусЗалоговогоБилета КАК СтатусЗалоговогоБилета
	               |ИЗ
	               |	РегистрСведений.ЛБ_СостояниеЗалоговогоБилета.СрезПоследних(
	               |			,
	               |			НомерЗалоговогоБилета = &Номер
	               |				И ЗалоговыйБилет.Организация = &Организация";
	Если ЗначениеЗаполнено(Ломбард) Тогда
		Запрос.Текст = Запрос.Текст + "
	               |				И ЗалоговыйБилет.Ломбард = &Ломбард";
	КонецЕсли;	
	Запрос.Текст = Запрос.Текст + ") КАК ЛБ_СостояниеЗалоговогоБилетаСрезПоследних
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.Период УБЫВ";	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() тогда
		Возврат Выборка.ЗалоговыйБилет;
	КонецЕсли;	
    Возврат неопределено;
КонецФункции;
